Given the following DataFrame df:

In [6]:
import pandas as pd

df = pd.DataFrame({'group': ['a', 'a', 'b', 'b', 'c', 'c'],
                   'value': [1, 2, 3, 4, 5, 6]})
df

  group  value
0     a      1
1     a      2
2     b      3
3     b      4
4     c      5
5     c      6

Select the rows where the value in the value column is greater than 5:

Select the rows where the value in the value column is even:

Select the rows where the value in the value column is between 3 and 5, inclusive:

Select the rows where the value in the value column is not equal to 3:

Select the rows where the value in the group column is 'a' or 'c':

Select the rows where the value in the value column is greater than the mean of the value column:

Select the rows where the value in the group column is in the list ['a', 'b']:

Select the rows where the value in the group column is not in the list ['a', 'b']:

### Missing data

https://pandas.pydata.org/docs/user_guide/missing_data.html

Given the following DataFrame df:

In [5]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'group': ['a', 'a', 'b', 'b', 'c', 'c'],
                   'value': [1, 2, 3, 4, 5, 6]})

df.loc[2, 'value'] = np.nan

df

  group  value
0     a    1.0
1     a    2.0
2     b    NaN
3     b    4.0
4     c    5.0
5     c    6.0

Select the rows where the value in the value column **is not** missing:

Select the rows where the value in the value column **is** missing: